Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: For example, the following code sets the expectation that the `Describe()` method of `my_mock` is called only after both `InitX()` and `InitY()` have been called.
it_it: Ad esempio, il codice seguente imposta la expectation che il metodo `Describe()` di `my_mock` venga chiamato dopo che sia `InitX()` che `InitY()` siano stati chiamati.

source: For example, the following code sets the expectation that the `Reset()` method of `my_mock` is called before both `GetSize()` and `Describe()`, and `GetSize()` and `Describe()` can occur in any order relative to each other:
it_it: Ad esempio, il codice seguente imposta la expectation che il metodo `Reset()` di `my_mock` venga chiamato prima sia di `GetSize()` che di `Describe()` e `GetSize()` e `Describe()` possono verificarsi in qualsiasi ordine relativo l'uno rispetto all'altro:

source: For example, the following code specifies that my_mock.GetNumber() is expected to be called exactly 3 times and will return 1, 2, and 3 respectively on the first, second, and third calls:
it_it: Ad esempio, il codice seguente specifica che my_mock.GetNumber() ci si aspetta che venga chiamata esattamente 3 volte e restituirà 1, 2 e 3 rispettivamente alla prima, seconda e terza chiamata:

source: For example, the following code specifies that `my_mock.GetNumber()` is expected to be called exactly 3 times and will return `1`, `2`, and `3` respectively on the first, second, and third calls:
it_it: Ad esempio, il codice seguente specifica che `my_mock.GetNumber()` ci si aspetta che venga chiamata esattamente 3 volte e restituirà `1`, `2` e `3` rispettivamente alla prima, seconda e terza chiamata:

source: For example, the following code specifies that by default, a call to my_mock.Greet() will return "hello":
it_it: Ad esempio, il codice seguente specifica che, per default, una chiamata a my_mock.Greet() restituirà "hello":

source: For example, the following code specifies that by default, a call to `my_mock.Greet()` will return `"hello"`:
it_it: Ad esempio, il codice seguente specifica che, per default, una chiamata a `my_mock.Greet()` restituirà `"hello"`:

source: For example, the following code suppresses warnings on the mock my_mock of type MockClass if a method other than DoSomething() is called:
it_it: Ad esempio, il codice seguente sopprime i warning sul mock my_mock di tipo MockClass se viene chiamato un metodo diverso da DoSomething():

source: For example, the following code suppresses warnings on the mock `my_mock` of type `MockClass` if a method other than `DoSomething()` is called:
it_it: Ad esempio, il codice seguente sopprime i warning sul mock `my_mock` di tipo `MockClass` se viene chiamato un metodo diverso da `DoSomething()`:

source: For example, the following code verifies that calling DoSomething(42) causes the process to die with an error message that contains the text My error:
it_it: Ad esempio, il codice seguente verifica che la chiamata a DoSomething(42) provochi la terminazione del processo con un messaggio di errore che contiene il testo My error:

source: For example, the following code verifies that calling NormalExit() causes the process to print a message containing the text Success to stderr and exit with exit status code 0:
it_it: Ad esempio, il codice seguente verifica che la chiamata a NormalExit() faccia sì che il processo stampi un messaggio contenente il testo Success su stderr e esca col codice di stato 0:

source: For example, the following code verifies that calling `DoSomething(42)` causes the process to die with an error message that contains the text `My error`:
it_it: Ad esempio, il codice seguente verifica che la chiamata a `DoSomething(42)` provochi la terminazione del processo con un messaggio di errore che contiene il testo `My error`:

source: For example, the following code verifies that calling `NormalExit()` causes the process to print a message containing the text `Success` to `stderr` and exit with exit status code 0:
it_it: Ad esempio, il codice seguente verifica che la chiamata a `NormalExit()` faccia sì che il processo stampi un messaggio contenente il testo `Success` su `stderr` e esca col codice di stato 0:

source: For example, the following code verifies that the string value1 starts with "Hello", value2 matches a regular expression, and value3 is between 5 and 10:
it_it: Ad esempio, il codice seguente verifica che la stringa value1 inizi con "Hello", che value2 corrisponda a un'espressione regolare e value3 sia compreso tra 5 e 10:

source: For example, the following code verifies that the string `value1` starts with `"Hello"`, `value2` matches a regular expression, and `value3` is between 5 and 10:
it_it: Ad esempio, il codice seguente verifica che la stringa `value1` inizi con `"Hello"`, che `value2` corrisponda a un'espressione regolare e `value3` sia compreso tra 5 e 10:

source: For example, the following statement will instantiate tests from the FooTest test suite each with parameter values "meeny", "miny", and "moe" using the Values parameter generator:
it_it: Ad esempio, la seguente istruzione istanzia i test dalla test suite FooTest ciascuno con i valori dei parametrzzati "meeny", "miny" e "moe" utilizzando il generatore di parametri Values:

source: For example, the following statement will instantiate tests from the `FooTest` test suite each with parameter values `"meeny"`, `"miny"`, and `"moe"` using the [`Values`](reference/testing.md#param-generators) parameter generator:
it_it: Ad esempio, la seguente istruzione istanzia i test dalla test suite `FooTest` ciascuno con i valori dei parametrzzati `"meeny"`, `"miny"` e `"moe"` utilizzando il generatore di parametri [`Values`](reference/testing.md#param-generators):

source: For example, the following tests won't be run by GoogleTest, even though they will still be compiled:
it_it: Ad esempio, i seguenti test non verranno eseguiti da GoogleTest, anche se verranno comunque compilati:

source: For example, the following two declarations are not equivalent:
it_it: Ad esempio, le due dichiarazioni seguenti non sono equivalenti:

source: For example, the following two declarations are *not* equivalent:
it_it: Ad esempio, le due dichiarazioni seguenti *non* sono equivalenti:

source: For example, the second assertion in the Dequeue test is ASSERT_NE(n, nullptr), as we need to dereference the pointer n later, which would lead to a segfault when n is NULL.
it_it: Ad esempio, la seconda asserzione nel test Dequeue è ASSERT_NE(n, nullptr), poiché in seguito dobbiamo dereferenziare il puntatore n, che porterebbe a un segfault quando n è NULL.

source: For example, the second assertion in the `Dequeue` test is `ASSERT_NE(n, nullptr)`, as we need to dereference the pointer `n` later, which would lead to a segfault when `n` is `NULL`.
it_it: Ad esempio, la seconda asserzione nel test `Dequeue` è `ASSERT_NE(n, nullptr)`, poiché in seguito dobbiamo dereferenziare il puntatore `n`, che porterebbe a un segfault quando `n` è `NULL`.

source: For example, to compare two `Foo` containers where `Foo` doesn't support `operator==`, one might write:
it_it: Ad esempio, per confrontare due contenitori `Foo` dove `Foo` non supporta `operator==`, si potrebbe scrivere:

source: For example, to specify that a call must occur even number of times, you can write
it_it: Ad esempio, per specificare che una chiamata deve avvenire un numero pari di volte, è possibile scrivere

source: For example, we may want to say that the first argument must be less than the second argument.
it_it: Ad esempio, potremmo voler dire che il primo argomento deve essere minore del secondo argomento.

source: For example, we don't support union ("x|y"), grouping ("(xy)"), brackets ("[xy]"), and repetition count ("x{5,7}"), among others.
it_it: Ad esempio, non supportiamo l'unione ("x|y"), il raggruppamento ("(xy)"), le parentesi quadre ("[xy]") e il conteggio delle ripetizioni ("x{5,7}"), tra le altre cose.

source: For example, we don't support union (`"x|y"`), grouping (`"(xy)"`), brackets (`"[xy]"`), and repetition count (`"x{5,7}"`), among others.
it_it: Ad esempio, non supportiamo l'unione (`"x|y"`), il raggruppamento (`"(xy)"`), le parentesi quadre (`"[xy]"`) e il conteggio delle ripetizioni (`"x{5,7}"`), tra le altre cose.

source: For example, we may care about A occurring before both B and C, but aren't interested in the relative order of B and C.
it_it: Ad esempio, potremmo preoccuparci che A si presenti prima sia di B e C, ma non siamo interessati all'ordine relativo di B e C.

source: For example, we may care about `A` occurring before both `B` and `C`, but aren't interested in the relative order of `B` and `C`.
it_it: Ad esempio, potremmo preoccuparci che `A` si presenti prima sia di `B` e `C`, ma non siamo interessati all'ordine relativo di `B` e `C`.

source: For example, when overloads have been used to implement default arguments:
it_it: Ad esempio, quando sono stati utilizzati gli overload per implementare argomenti di default:

source: For example, when using an ACTION as a stub action for mock function:
it_it: Ad esempio, quando si utilizza ACTION come azione stub per la funzione mock:

source: For example, when using an `ACTION` as a stub action for mock function:
it_it: Ad esempio, quando si utilizza `ACTION` come azione stub per la funzione mock:

source: For example, you may want to make sure that all of a GUI library's test suites don't leak important system resources like fonts and brushes.
it_it: Ad esempio, si potrebbe vole essere sicuri che tutte le test suite di una libreria GUI non abbiano importanti "leak" di risorse di sistema come font e brush.

source: For example, you can define a matcher to test whether an int is divisible by 7 and then use it like this:
it_it: Ad esempio, si può definire un matcher per verificare se un int è divisibile per 7 e poi usarlo in questo modo:

source: For example, you can define a matcher to test whether an `int` is divisible by 7 and then use it like this:
it_it: Ad esempio, si può definire un matcher per verificare se un `int` è divisibile per 7 e poi usarlo in questo modo:

source: For example, you can rewrite `T2 Foo(T1 x)` to `void Foo(T1 x, T2* result)`.
it_it: Per esempio, si può riscrivere `T2 Foo(T1 x)` in `void Foo(T1 x, T2* result)`.

source: For example, you can say AtLeast(5) or Between(2, 4).
it_it: Ad esempio, si può dire AtLeast(5) o Between(2, 4).

source: For example, you can say `AtLeast(5)` or `Between(2, 4)`.
it_it: Ad esempio, si può dire `AtLeast(5)` o `Between(2, 4)`.

source: For example, you may be using the SetUp() method of your test fixture to set the golden file name based on which test is running.
it_it: Ad esempio, si potrebbe utilizzare il metodo SetUp() della fixture per impostare il nome del "golden file" (ndt: Output campione) in base al test in esecuzione.

source: For example, you may be using the `SetUp()` method of your test fixture to set the golden file name based on which test is running.
it_it: Ad esempio, si potrebbe utilizzare il metodo `SetUp()` della fixture per impostare il nome del "golden file" (ndt: Output campione) in base al test in esecuzione.

source: For example, you may have a bunch of ON_CALLs in your test fixture to set the common mock behavior shared by all tests in the same group, and write (scarcely) different EXPECT_CALLs in different TEST_Fs to verify different aspects of the code's behavior.
it_it: Ad esempio, si potrebbero avere un sacco di ON_CALL nella fixture di test per impostare il comportamento comune del mock condiviso da tutti i test nello stesso gruppo e scrivere (appena) diversi EXPECT_CALL in diversi TEST_F per verificare diversi aspetti del comportamento del codice.

source: For example, you may have a bunch of `ON_CALL`s in your test fixture to set the common mock behavior shared by all tests in the same group, and write (scarcely) different `EXPECT_CALL`s in different `TEST_F`s to verify different aspects of the code's behavior.
it_it: Ad esempio, si potrebbero avere un sacco di `ON_CALL` nella fixture di test per impostare il comportamento comune del mock condiviso da tutti i test nello stesso gruppo e scrivere (appena) diversi `EXPECT_CALL` in diversi `TEST_F` per verificare diversi aspetti del comportamento del codice.

source: For example, you may want to make sure the `Set()` and `Clear()` calls are right next to the code that uses your mock.
it_it: Ad esempio, per assicurarsi che le chiamate `Set()` e `Clear()` siano proprio accanto al codice che utilizza il mock.

source: For example, you may want to use mocks or fake objects instead of real ones in your tests.
it_it: Ad esempio, si potrebbero utilizzare oggetti mock o fake invece di quelli reali nei test.

source: For example, you may write:
it_it: Per esempio, si può scrivere:

source: For instance, if class Foo has methods char DoThis(int n) and bool DoThis(double x) const, and you want to invoke the latter, you need to write Invoke(&fake_, static_cast<bool (FakeFoo::*)(double) const>(&FakeFoo::DoThis)) instead of Invoke(&fake_, &FakeFoo::DoThis) (The strange-looking thing inside the angled brackets of static_cast is the type of a function pointer to the second DoThis() method.).
it_it: Ad esempio, se la classe Foo ha i metodi char DoThis(int n) e bool DoThis(double x) const, per invocare quest'ultimo, si deve scrivere Invoke(&fake_, static_cast<bool (FakeFoo::*)(double) const>(&FakeFoo::DoThis)) invece di Invoke(&fake_, &FakeFoo::DoThis) (La cosa strana all'interno delle parentesi angolari di static_cast è il tipo di puntatore a funzione al secondo metodo DoThis()).

source: For instance, if class `Foo` has methods `char DoThis(int n)` and `bool DoThis(double x) const`, and you want to invoke the latter, you need to write `Invoke(&fake_, static_cast<bool (FakeFoo::*)(double) const>(&FakeFoo::DoThis))` instead of `Invoke(&fake_, &FakeFoo::DoThis)` (The strange-looking thing inside the angled brackets of `static_cast` is the type of a function pointer to the second `DoThis()` method.).
it_it: Ad esempio, se la classe `Foo` ha i metodi `char DoThis(int n)` e `bool DoThis(double x) const`, per invocare quest'ultimo, si deve scrivere `Invoke(&fake_, static_cast<bool (FakeFoo::*)(double) const>(&FakeFoo::DoThis))` invece di `Invoke(&fake_, &FakeFoo::DoThis)` (La cosa strana all'interno delle parentesi angolari di `static_cast` è il tipo di puntatore a funzione al secondo metodo `DoThis()`).

source: For instance, the following program
it_it: Ad esempio, il seguente programma

source: For maximum brevity and reusability, the ACTION* macros don't ask you to provide the types of the mock function arguments and the action parameters.
it_it: Per la massima brevità e riusabilità, le macro ACTION* non chiedono di fornire i tipi degli argomenti della funzione mock né i parametri dell'azione.

source: For maximum brevity and reusability, the `ACTION*` macros don't ask you to provide the types of the mock function arguments and the action parameters.
it_it: Per la massima brevità e riusabilità, le macro `ACTION*` non chiedono di fornire i tipi degli argomenti della funzione mock né i parametri dell'azione.

source: For mock functions with a return type of T, this default value is returned from function calls that do not specify an action.
it_it: Per le funzioni mock con un tipo di ritorno T, questo valore di default viene restituito dalle chiamate di funzione che non specificano una action.

source: For mock functions with a return type of `T`, this default value is returned from function calls that do not specify an action.
it_it: Per le funzioni mock con un tipo di ritorno `T`, questo valore di default viene restituito dalle chiamate di funzione che non specificano una action.

source: For more about the return type testing::AssertionResult, see Using a Function That Returns an AssertionResult.
it_it: Per ulteriori informazioni sul tipo testing::AssertionResult restituito, vedere Utilizzo di una Funzione che Restituisce un AssertionResult.

source: For more details, see sample9_unittest.cc.
it_it: Per ulteriori dettagli, consultare sample9_unittest.cc.

source: For more about the return type `testing::AssertionResult`, see [Using a Function That Returns an AssertionResult](../advanced.md#using-a-function-that-returns-an-assertionresult).
it_it: Per ulteriori informazioni sul tipo `testing::AssertionResult` restituito, vedere [Utilizzo di una Funzione che Restituisce un AssertionResult](../advanced.md#using-a-function-that-returns-an-assertionresult).

source: For more advanced cases, you may need to define your own matcher class.
it_it: Per i casi più avanzati, potrebbe essere necessario definire la propria classe matcher.

source: For more convenience and flexibility, you can also use the following pre-defined symbols in the body of ACTION:
it_it: Per maggiore comodità e flessibilità, si possono utilizzare i seguenti simboli predefiniti nel corpo di ACTION:

source: For more convenience and flexibility, you can also use the following pre-defined symbols in the body of `ACTION`:
it_it: Per maggiore comodità e flessibilità, si possono utilizzare i seguenti simboli predefiniti nel corpo di `ACTION`:

source: For more details regarding AbslStringify() and its integration with other libraries, see go/abslstringify.
it_it: Per maggiori dettagli su AbslStringify() e la sua integrazione con le altre librerie, vedere go/abslstringify.

source: For more details regarding `AbslStringify()` and its integration with other libraries, see go/abslstringify.
it_it: Per maggiori dettagli su `AbslStringify()` e la sua integrazione con le altre librerie, vedere go/abslstringify.

source: For more details, see [sample9_unittest.cc].
it_it: Per ulteriori dettagli, consultare [sample9_unittest.cc].

source: For more information about Bazel BUILD files, see the Bazel C++ Tutorial.
it_it: Per ulteriori informazioni sui file BUILD, vedere il Bazel C++ Tutorial.

source: For more information about Bazel `BUILD` files, see the [Bazel C++ Tutorial](https://docs.bazel.build/versions/main/tutorial/cpp.html).
it_it: Per ulteriori informazioni sui file Bazel `BUILD`, vedere il [Bazel C++ Tutorial](https://docs.bazel.build/versions/main/tutorial/cpp.html).

source: For more information about how to create CMakeLists.txt files, see the CMake Tutorial.
it_it: Per ulteriori informazioni su come creare i file CMakeLists.txt, consultare il Tutorial su CMake.

source: For more information about how to create `CMakeLists.txt` files, see the [CMake Tutorial](https://cmake.org/cmake/help/latest/guide/tutorial/index.html).
it_it: Per ulteriori informazioni su come creare i file `CMakeLists.txt`, consultare il [Tutorial su CMake](https://cmake.org/cmake/help/latest/guide/tutorial/index.html).

source: For more information about supported operations on AbslStringify()'s sink, see go/abslstringify.
it_it: Per ulteriori informazioni sulle operazioni supportate sul sink di AbslStringify(), vedere go/abslstringify.

source: For more information about supported operations on `AbslStringify()`'s sink, see go/abslstringify.
it_it: Per ulteriori informazioni sulle operazioni supportate sul sink di `AbslStringify()`', vedere go/abslstringify.

source: For more information, see Adding Traces to Assertions.
it_it: Per ulteriori informazioni, consultare Adding Traces to Assertions.

source: For more information, see Type-Parameterized Tests.
it_it: Per ulteriori informazioni, consultare Test con i Tipi Parametrizzati.

source: For more information, see Value-Parameterized Tests.
it_it: Per ulteriori informazioni, consultare Test con Valori Parametrizzati.

source: For more information, see Typed Tests.
it_it: Per ulteriori informazioni, consultare Test Tipizzati.

source: For more information, see [Adding Traces to Assertions](../advanced.md#adding-traces-to-assertions).
it_it: Per ulteriori informazioni, consultare [Adding Traces to Assertions](../advanced.md#adding-traces-to-assertions).

source: For more information, see [Type-Parameterized Tests](../advanced.md#type-parameterized-tests).
it_it: Per ulteriori informazioni, consultare [Type-Parameterized Tests](../advanced.md#type-parameterized-tests).

source: For more information, see [Typed Tests](../advanced.md#typed-tests).
it_it: Per ulteriori informazioni, consultare [Test Tipizzati](../advanced.md#typed-tests).

source: For more information, see [Value-Parameterized Tests](../advanced.md#value-parameterized-tests).
it_it: Per ulteriori informazioni, consultare [Test con Valori Parametrizzati](../advanced.md#value-parameterized-tests).

source: For more on uninteresting calls, nice mocks, and strict mocks, read "The Nice, the Strict, and the Naggy".
it_it: Per ulteriori informazioni su chiamate uninteresting, mock nice e mock strict, leggere "Nice, Strict e Naggy".

source: For more on uninteresting calls, nice mocks, and strict mocks, read ["The Nice, the Strict, and the Naggy"](#NiceStrictNaggy).
it_it: Per ulteriori informazioni su chiamate uninteresting, mock nice e mock strict, leggere ["Nice, Strict e Naggy"](#NiceStrictNaggy).

source: For negative numbers, this routine returns -1.
it_it: Per i numeri negativi, questa routine restituisce -1.

source: For other types, it prints the raw bytes in the value and hopes that you the user can figure it out.
it_it: Per gli altri tipi, stampa i byte grezzi nel valore e spera che l'utente possa capirlo.

source: For readability, it is recommended to write using ::testing::Foo; once in your file before using the name Foo defined by gMock.
it_it: Per maggiore leggibilità, si consiglia di scrivere using ::testing::Foo; una volta nel file prima di utilizzare il nome Foo definito da gMock.

source: For readability, it is recommended to write `using ::testing::Foo;` once in your file before using the name `Foo` defined by gMock.
it_it: Per maggiore leggibilità, si consiglia di scrivere `using ::testing::Foo;` una volta nel file prima di utilizzare il nome `Foo` definito da gMock.

source: For technical reasons, there are some caveats:
it_it: Per ragioni tecniche, ci sono alcune avvertenze:

source: For testing various implementations of the same interface, either typed tests or value-parameterized tests can get it done.
it_it: Per testare varie implementazioni della stessa interfaccia, è possibile eseguire test tipizzati o test con valori parametrizzati.

source: For that GoogleTest offers the following macros:
it_it: Per questo GoogleTest offre le seguenti macro:

source: For that we have another macro
it_it: Per questo abbiamo un'altra macro

source: For that you can use the macro:
it_it: Per questo si può usare la macro:

source: For the list of built-in cardinalities you can use, see here.
it_it: Per l'elenco delle cardinalità native utilizzabili, vedere qui.

source: For the complete list of assertions provided by GoogleTest, see the Assertions Reference.
it_it: Per l'elenco completo delle asserzioni fornite da GoogleTest, consultare i Riferimenti sulle Asserzioni.

source: For the complete list of assertions provided by GoogleTest, see the [Assertions Reference](reference/assertions.md).
it_it: Per l'elenco completo delle asserzioni fornite da GoogleTest, consultare i [Riferimenti sulle Asserzioni](reference/assertions.md).

source: For the flags to work, your programs must call ::testing::InitGoogleTest() before calling RUN_ALL_TESTS().
it_it: Affinché i flag funzionino, i programmi devono chiamare ::testing::InitGoogleTest() prima di chiamare RUN_ALL_TESTS().

source: For the flags to work, your programs must call `::testing::InitGoogleTest()` before calling `RUN_ALL_TESTS()`.
it_it: Affinché i flag funzionino, i programmi devono chiamare `::testing::InitGoogleTest()` prima di chiamare `RUN_ALL_TESTS()`.
